tests/tools/artillery/stressTests/textSearch/es.fullTextSearch.yml
config:
  target: 'http://0.0.0.0:3002'
  payload:
    # path is relative to the location of the test script
    path: '../../dbSample.csv'
    fields:
      - 'itemId'
      - 'itemName'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - get:
          url: '/items/?search={{itemName.slice(0, 10)}}'